package msg

////////////////////////////////////////////////////////////////////////////////
// TAG 消息类型
type TAG string

const (
	//订单消息
	TAG00 TAG = "100" // 订单创建消息
	TAG01 TAG = "101" // 订单支付/确认消息
	TAG02 TAG = "102" // 卖家发货消息
	TAG03 TAG = "103" // 交易完成消息
	TAG04 TAG = "104" // 发货物流变更消息
	TAG05 TAG = "105" // 买家收货信息变更消息
	TAG06 TAG = "106" // 订单取消消息

	//退款消息
	TAG10 TAG = "200" // 买家发起售后申请消息
	TAG11 TAG = "201" // 同意退款消息
	TAG12 TAG = "202" // 同意退货申请消息
	TAG13 TAG = "203" // 买家退货给卖家消息
	TAG14 TAG = "204" // 拒绝退款消息
	TAG15 TAG = "205" // 拒绝退货申请消息
	TAG16 TAG = "206" // 退款成功消息
	TAG17 TAG = "207" // 售后关闭消息¬
)
